<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>Insert title here</title>
</head>
<body>
	<!-- 
		*프레임워크
		- 개발자가 편리한 환경에서 개발할 수 있도록 제공하는 툴, 구조라고 생각
		- 소프트웨어 개발의 입장으로써는 공통적으로 사용되는 라이브러리/개발도구/인터페이스 등등을 의미
		- 개발자는 프레임워크가 정한대로 코드를 작성해야 함 -> 제어의 역전(IoC)
		
		* 프레임워크의 필요성
		- 전체적인 설계 패턴(구조)를 제공하여 생산성과 코드의 품질을 높여준다.
		-> 개발자들이 "동일성"있게 "빠르고". "안정적"으로 개발하기 위해 프레임워크를 사용
		-> 생산성이 향상되고 일정수준의 코드 품질을 기대할 수 있음.
		
		* 프레임워크의 특징
		- 개발자들이 따라야하는 가이드라인 제공
			=> 자유롭게 설계/코딩 X, 가이드대로 설계/코딩 O
		- 개발할 수 있는 범위가 정해져있다.
		- 개발자들을 위한 다양한 도구들을 지원함.
		
		* 프레임워크의 단점
		- 프레임워크에 너무 의존적이면 개발자들의 능력이 떨어짐.
		- 익숙해지기까지 시간이 걸림(러닝커브 발생)
		
		* 프레임워크 종류
		- 영속성 : 데이터 관련한 CRUD기능을 보다 편리하게 작업할 수 있도록 제공해주는 프레임워크 ex) MyBatis, Hibernate, JPA
		- 자바 : 웹 어플리케이션에 초점을 맞춰 필요한 요소들을 모듈화해서 제공해주는 프레임워크 ex) Spring
		- 화면 구현 : front-end를 보다 효율적으로 제작하고 유지보수할 수 있게 구조를 제공하는 프레임워크 ex) react, view, angular...
		- 기능 및 지원 : 특정 기능이나 업무수행에 도움을 줄 수 있게 제공하는 프레임워크 ex) log4j, junit5
	 -->
	 
	 <jsp:include page="/views/common/menubar.jsp" />
</body>
</html>